// Подключение ЖК-дисплея 1602 по интерфейсу I2C

#include "LCD1602_I2C.h"

//=============================================================================
// Отправка полубайта
void send_half_byte(uint8_t byte)
{
    I2C_write_slave(I2C1, LCD1602_addr, byte |= 1 << E | 1 << P3);	// установка линии E и P3 в "1" и запись полубайта в 4 ст. разряда порта LCD
    _delay_ms(5);// задержка (t_dsw = PW_eh > 230 нс)
    I2C_write_slave(I2C1, LCD1602_addr, byte &= ~(1 << E));		// сброс линии E в "0"
    return;
}

//=============================================================================
// Отправка команды
void send_com(uint8_t com)
{
    send_half_byte(com & 0xF0);								// выделяем старший полубайт
    send_half_byte((com & 0x0F) << 4);						// выделяем младший полубайт
    return;
}

//=============================================================================
// Отправка данных
void send_data(uint8_t data)
{
    send_half_byte((data & 0xF0) | 1 << RS);					// выделяем старший байт
    send_half_byte((data & 0x0F) << 4 | 1 << RS);				// выделяем младший байт
    return;
}

//=============================================================================
// Инициализация ЖК-дисплея
void LCD_init(void)
{
    _delay_ms(50);					    // пауза не менее 40 мс. после 2,7 В (~50 мс)
    send_half_byte(0x30);               // установка 8 бит (отправка старшего полубайта 0b00110000)
    // D7  0b[0]xxxxxxx
    // D6  0bx[0]xxxxxx
    // D5  0bxx[1]xxxxх - 1 - признак команды
    // DL  0bxxx[1]xxxx - 0 = 4-разрядная шина; 1 = 8-разрядная шина
    _delay_ms(5);						// пауза не менее 4,1 мс (~5 мс)
    send_half_byte(0x30);               // установка 8 бит (отправка старшего полубайта 2-й раз)
    _delay_us(120);						// пауза не менее 100 мкс (~120 мкс)
    send_half_byte(0x30);               // установка 8 бит (отправка старшего полубайта 3-й раз)
    _delay_us(50);                      // пауза не менее 37 мкс (~50 мкс)
    send_half_byte(0x20);               // установка 4 бита (отправка старшего полубайта 0b00100000)
    _delay_us(50);                      // пауза не менее 37 мкс (~50 мкс)
    send_com(0x2C);       	            // настройка 4-х битного режима
    // D7  0b[0]xxxxxxx
    // D6  0bx[0]xxxxxx
    // D5  0bxx[1]xxxxx - 1 - признак команды
    // D4  0bxxx[0]xxxx
    // N   0bxxxx[1]xxx - 0 = 1 строка; 1 = 2 строки
    // F   0bxxxxx[1]xx - 0 = шрифт 5х7; 1 = шрифт 5х10
    // D1  0bxxxxxx[0]x
    // D0  0bxxxxxxx[0]
    _delay_us(50);                      // пауза не менее 37 мкс (~50 мкс)
    send_com(0x08);     				// включение дисплея (курсор виден и мигает)
    _delay_us(50);                      // пауза не менее 37 мкс (~50 мкс)
    send_com(0x01);	        			// очистка дисплея и установка курсора в 0 позицию
    _delay_ms(2);						// пауза не менее 1,5 мс (~2 мс)
    send_com(0x06);     				// направление сдвига курсора и записи символов (0b00000110)
    // D7  0b[0]xxxxxxx
    // D6  0bx[0]xxxxxx
    // D5  0bxx[0]xxxxx
    // D4  0bxxx[0]xxxx
    // D3  0bxxxx[0]xxx
    // D2  0bxxxxx[1]xx - 1 - признак команды
    // I/D 0bxxxxxx[1]x - 0 = сдвиг влево; 1 = сдвиг вправо
    // S   0bxxxxxxx[0] - 0 = сдвиг экрана запрещен; 1 = разрашен
    _delay_us(50);                      // пауза не менее 37 мкс (~50 мкс)
    send_com(0x0F);	        			// включение дисплея (курсор виден и мигает 0b00001111)
    // D7  0b[0]xxxxxxx
    // D6  0bx[0]xxxxxx
    // D5  0bxx[0]xxxxx
    // D4  0bxxx[0]xxxx
    // D3  0bxxxx[1]xxx - 1 - признак команды
    // D   0bxxxxx[1]xx - 0 = дисплей отключен; 1 = включен
    // C   0bxxxxxx[0]x - 0 = курсор не виден; 1 = курсор виден
    // B   0bxxxxxxx[0] - 0 = курсор не мигает; 1 = курсор мигает
    _delay_us(50);                      // пауза не менее 37 мкс (~50 мкс)
}

//=============================================================================
// Установка курсора в заданную позицию
void LCD_pos(uint8_t y, uint8_t x)
{
    uint8_t pos;
    pos = (0x40 * (y - 1) + (x - 1)) | 0x80;		// расчёт значения POS
    send_com(pos);						// D7  0b[1]xxxxxxx - 1 - признак команды
    // D6  0bx[0]xxxxxx - бит адреса DDRAM
    // D5  0bxx[0]xxxxx - бит адреса DDRAM
    // D4  0bxxx[0]xxxx - бит адреса DDRAM
    // D3  0bxxxx[0]xxx - бит адреса DDRAM
    // D   0bxxxxx[0]xx - бит адреса DDRAM
    // C   0bxxxxxx[0]x - бит адреса DDRAM
    // B   0bxxxxxxx[0] - бит адреса DDRAM
    _delay_us(40);                      // пауза не менее 37 мкс (~40 мкс)
    return;
}

//=============================================================================
// Отправка строки на LCD-дисплей
void LCD_send_string(char* str)
{
    while(*str) {						// пока не терминальный 0
        send_data(*str);				// отправляем очередной символ
        str++;							// увеличиваем указатель на 1
        _delay_us(40);                  // пауза не менее 37 мкс (~40 мкс)
    }
}